import os
os.environ['KMP_DUPLICATE_LIB_OK']='True'
import cv2
from PIL import Image
import torch
import torchvision
from torchvision import datasets, models, transforms
import torch.nn.functional as F
import torch.nn as nn
import numpy as np
import os
import time
import requests
import io
import base64
from flask import Flask, render_template, jsonify, request, redirect
from PIL import Image
from pandas.core import methods
import subprocess
import argparse
from PIL import Image
import os
import cv2
os.environ["CUDA_VISIBLE_DEVICES"] = '2,3'
os.environ['TF_CPP_MIN_LOG_LEVEL'] = '2'

basedir = os.path.abspath(os.path.dirname(__file__))


tsfrm = transforms.Compose([
    transforms.Grayscale(3),        # 将图像转换为灰度图像，通道数为3
    transforms.Resize((224, 224)),  # 将图像变换为指定大小
    transforms.ToTensor(),          # 将PIL图像转换为tensor数据
    transforms.Normalize([0.5, 0.5, 0.5], [0.5, 0.5, 0.5])      # 将PIL图像转换为tensor数据
])

# 0.水果 1.蔬菜 2.服装 3.零食 (顺序需要按照训练集中的顺序)
classes = ('三七', '丹参', '乌梅', '五加皮', '五味子', '人参', '何首乌', '侧柏叶', '党参', '半夏', '夏枯草', '山楂', '巴戟天', '板蓝根', '枸杞子', '柴胡', '灵芝', '甘草', '白术', '白茅根', '百合', '益母草', '红花', '苍术', '茯苓', '草果', '菟丝子', '虫草', '覆盆子', '酸枣仁', '金银花', '防风', '陈皮')

# 判断GPU是否可用，有cpu和cuda两种，这里的cuda就是gpu
device = torch.device("cuda:0" if torch.cuda.is_available() else "cpu")
print(device)

# 模型推理
def modelpre(grey_img):
    model_eval = models.resnet18(pretrained=False)  # 加载ResNet18模型
    num_ftrs = model_eval.fc.in_features   # 获取默认的全连接层的输入维度
    model_eval.fc = nn.Linear(num_ftrs, 33)  # 替换模型的全连接层，使其输出4个分类
    # 加载已经训练好的模型权重
    model_eval.load_state_dict(torch.load('./model/zhongyao.pkl', map_location=device))
    # 在推理前，务必调用model.eval()去设置dropout和batch normalization层为评估模式
    model_eval.eval()
    # 将OpenCV图像转换为PIL图像，并进行预处理
    image = Image.fromarray(cv2.cvtColor(grey_img, cv2.COLOR_GRAY2RGB))
    # PIL图像数据转换为tensor数据，并归一化
    img = tsfrm(image)
    # 图像增加1维[batch_size,通道,高,宽]
    img = img.unsqueeze(0)
    # 进行模型推理，得到分类结果
    output = model_eval(img)
    # 计算每个分类的概率 prob是4个分类的概率
    prob = F.softmax(output, dim=1)
    print(prob) # tensor([[0.0360, 0.0061, 0.9529, 0.0050]], grad_fn=<SoftmaxBackward>)
    # 找出最大概率的分类.torch.max() 函数会返回输入张量中最大值和最大值的索引
    value, predicted = torch.max(output.data, 1) # value模型预测出来的最大概率值
    label = predicted.numpy()[0]   # 将Tensor转换为numpy数组
    # print(label)  # 打印出标签的索引
    pred_class = classes[predicted.item()]  # 提取最佳分类的标签
    # print(pred_class)
    return pred_class,label


def cv_imread(file_path):
    cv_img = cv2.imdecode(np.fromfile(file_path, dtype=np.uint8), -1)
    # im decode读取的是rgb，如果后续需要opencv处理的话，需要转换成bgr，转换后图片颜色会变化
    cv_img = cv2.cvtColor(cv_img, cv2.COLOR_RGB2BGR)
    return cv_img

def return_img_stream(img_local_path):
    img_stream = ''
    with open(img_local_path, 'rb') as img_f:
        img_stream = img_f.read()
        img_stream = base64.b64encode(img_stream).decode()
    return img_stream

app = Flask(__name__)

@app.route('/', methods=['GET', 'POST'])
def index():
    # if request.method == "GET":
    #     img_path1 = 'D:\BaiduNetdiskDownload\基于PyTorch的图像识别' + '\static' + '\images\\'+'intro-img-713x573.jpg'
    #     img_stream1 = return_img_stream(img_path1)
    #     return render_template("gui.html",img_stream=img_stream1)
    if request.method == 'POST':
        d = time.strftime('%Y-%m-%d-%H-%M-%S')
        huoquimg=request.files.get('qw')
        path = basedir + '\image\\'
        file_path = path + d +huoquimg.filename
        print(file_path)
        huoquimg.save(file_path)
        dic='image\\'+d+huoquimg.filename
        img_source = cv2.imread(dic)
        cv2.imshow("img3", img_source)
        # 图像灰度化
        grey_img = cv2.cvtColor(img_source, cv2.COLOR_BGR2GRAY)
        an = modelpre(grey_img)
        caoyaom=an[0]
        cao={'cao12': caoyaom}
        choice=an[1]
        if choice == 0:
            user = {
                'username': '主产于云南文山州各县，文山县、砚山县、马关、西畴、广南、麻栗坡、富宁、邱北等，称为“文山七”另广西田阳、靖西、田东、德保等地也有种植，习称“田七”，为著名的道地药材。'}
            c = {
                'qw': '1、主根呈类圆锥形或圆柱形，长1～6cm，直径1～4cm。表面灰褐色或灰黄色，有断续的纵皱纹和支根痕。顶端有茎痕，周围有瘤状突起。体重，质坚实，断面灰绿色、黄绿色或灰白色，木部微呈放射状排列。气微，味苦回甜。筋条呈圆柱形或圆锥形，长2～6cm，上端直径约0.8cm，下端直径约0.3cm。剪口呈不规则的皱缩块状或条状，表面有数个明显的茎痕及环纹，断面中心灰绿色或白色，边缘深绿色或灰色。'}
            d = {
                'as': '三七性温，味甘、微苦。归肝、胃经。具有补血抗炎、活血化瘀的功效，能够抗氧化，抗衰老。三七能扩张血管，降低冠脉阻力，增加冠脉流量，加强和改善冠脉微循环，增加营养性心肌血流量，还能够降低动脉压，略减心率，从而明显减少心肌的耗氧量。纺锤根可活血止血、去瘀止痛、滋补强壮，为著名跌打损伤特效药。'}
            a = {'zx': '孕妇忌服。'}
        elif choice == 1:
            user = {
                'username': '丹参的产地较广，中国除黑龙江、吉林、内蒙古北部高寒地区外，几乎各省、区、市分布，产于河北、山西、陕西、山东、河南、江苏、浙江、安徽、江西、湖南等地。'}
            c = {
                'qw': '丹参（Salvia miltiorrhiza Bunge）别名血参、紫丹参、五凤花、活血根等，为唇形科鼠尾草属的多年生直立草本植物 ，因其根皮赤而肉紫，形状似参，故名“丹参”。根肥厚，肉质，疏生支根；茎直立，四稜形，密被长柔毛，多分。'}
            d = {
                'as': '丹参性苦、微寒，归心、心包、肝经，具有活血祛瘀、调经止痛、除烦安神的功效，主治妇女月经不调，产后瘀滞腹痛，跌打损伤、烦躁不安等病症。'}
            a = {'zx': '无瘀血者慎服。畏咸水。反藜芦。妊娠无故勿服。'}
        elif choice == 2:
            user = {'username': '中国各地均有栽培，但以长江流域以南各省最多，江苏北部和河南南部也有少数品种，某些品种已在华北引种成功。'}
            c = {'qw': '乌梅，中药名。为蔷薇科植物梅（学名：Prunus mume Siebold & Zucc. ）的干燥近成熟果实。果实近球形，直径2-3厘米，黄色或绿白色，被柔毛，味酸；果肉与核粘贴；核椭圆形，顶端圆形而有小突尖头，基部渐狭成楔形，两侧微扁，腹棱稍钝，腹面和背棱上均有明显纵沟，表面具蜂窝状孔穴。'}
            d = {'as': '乌梅味酸，性温，无毒，具有安心、除热、下气、祛痰、止渴调中、杀虫的功效，治肢体痛、肺痨病。'}
            a = {'zx': '有实邪者忌服。多食损齿。多啖伤骨，蚀脾胃，令人发热。疟痢初起者禁用。'}
        elif choice == 3:
            user = {'username': '生于山坡、丘陵、河边等较潮湿处；主产于湖北、河南、安徽等地。'}
            c = {'qw': '五加皮，中药名。为五加科植物细柱五加的干燥根皮。外表面灰褐色，有稍扭曲的纵皱纹和横长皮孔样斑痕；内表面淡黄色或灰黄色，有细纵纹。体轻，质脆，易折断，断面不整齐，灰白色。气微香，味微辣而苦。'}
            d = {'as': '性温，味辛、苦。归肝经、肾经。祛风湿、补肝肾、强筋骨。属祛风湿药下分类的祛风湿强筋骨药。'}
            a = {'zx': '阴虚火旺者慎服。'}
        elif choice == 4:
            user = {'username': '生于阳坡杂木林中，缠绕在其他植物上。分布东北、华北、湖北、湖南、江西、四川等地。'}
            c = {'qw': '五味子：呈不规则的球形或扁球形，直径5～8mm。表面红色、紫红色或暗红色，皱缩，显油润，有的表面呈黑红色或出现“白“白霜”。果肉柔软，种子1～2，肾形，表面棕黄色，有光泽，种皮薄而脆。果肉气微，味酸；种子破碎后，有香气，味辛、微苦。'}
            d = {'as': '性味酸，温。归经 入肺、肾经，主治敛肺，滋肾，生津，收汗，涩精。治肺虚喘咳，口干作渴，自汗，盗汗，劳伤羸瘦，梦遗滑精，久泻久痢。'}
            a = {'zx': '外有表邪，内有实热，或咳嗽初起、痧疹初发者忌服。'}
        elif choice == 5:
            user = {'username': '生于山坡密林中，分布于我国东北诸省。辽宁和吉林有大量栽培，近年来河北、山西、陕西、甘肃、宁夏、湖北等省区也有种植。'}
            c = {'qw': '主根呈纺锤形或圆柱形，长3～15cm，直径1～2cm。表面灰黄色，上部或全体有疏浅断续的粗横纹及明显的纵皱，下部有支根2～3条，并着生多数细长的须根，须根上常有不明显的细小疣状突起。根茎（芦头）长1～4cm，直径0.3～1.5cm，多拘挛而弯曲，具不定根和稀疏的凹窝状茎痕（芦碗）。质较硬，断面淡黄白色，显粉性，形成层环纹棕黄色，皮部有黄棕色的点状树脂道及放射状裂隙。香气特异，味微苦、甘。'}
            d = {'as': '性味 甘、微苦，平。主治 大补元气，复脉固脱，补脾益肺，生津，安神。用于体虚欲脱，肢冷脉微，脾虚食少，肺虚喘咳，津伤口渴，内热消渴，久病虚羸，惊悸失眠，阳痿宫冷；心力衰竭，心原性休克。'}
            a = {'zx': '实证、热证忌服。茯苓为使。恶溲疏。反藜芦。畏五灵脂。恶皂荚、黑豆。动紫石英。'}
        elif choice == 6:
            user = {'username': '生长于草坡、路边、山坡石隙及灌木丛中。分布河南、山东、安徽、江苏、浙江、福建、广东、广西、江西、湖南、湖北、四川、贵州、云南等地。主产河南、湖北、贵州、四川、江苏、广西等地。'}
            c = {'qw': '多年生缠绕草本。根细长，末端成肥大的块根，外表红褐色至暗褐色。茎基部略呈木质，中空。叶互生，具长柄，叶片狭卵形或心形，长4～8厘米，宽2.5～5厘米，先端渐尖，基部心形或箭形，全缘或微带波状，上面深绿色，下面浅绿色，两面均光滑无毛。托叶膜质，鞘状，褐色，抱茎，长5～7毫米。'}
            d = {'as': '治肝肾阴亏，发须早白，血虚头晕，腰膝软弱，筋骨酸痛，遗精，崩带，久疟，久痢，慢性肝炎，痈肿，瘰疬，肠风，痔疾。制首乌补肝肾，益精血，乌须发，壮筋骨；用于眩晕耳鸣、须发早白、腰膝酸软、肢体麻木、神经衰弱、高血脂症。'}
            a = {'zx': '大便清泄及有湿痰者不宜。'}
        elif choice == 7:
            user = {'username': '生于湿润肥沃地，石灰岩石地也有生长。分布于东北南部，经华北向南过广东、广西北部，西至陕西、甘肃、西南至四川、云南、贵州等地。'}
            c = {'qw': '本品多分枝，小枝扁平。叶细小鳞片状，交互对生，贴伏于枝上，深绿色或黄绿色。质脆，易折断。气清香，味苦涩、微辛。'}
            d = {'as': '治吐血、衄血、尿血、血痢、肠风、崩漏，风湿痹痛，细菌性痢疾，高血压，咳嗽，丹毒，痄腮，烫伤。'}
            a = {'zx': '与酒相宜。多食亦能倒胃。'}
        elif choice == 8:
            user = {'username': '生于山地灌木丛中及林缘，分布东北及河北、河南、山西、陕西、甘肃、内蒙古、青海等地。'}
            c = {'qw': '呈长圆柱形，稍弯曲，长10～35cm，直径0.4～2cm。表面黄棕色至灰棕色，根头部有多数疣状突起的茎痕及芽，每个茎痕的顶端呈凹下的圆点状；根头下有致密的环状横纹，向下渐稀疏，有的达全长的一半，栽培品环状横纹少或无；全体有纵皱纹及散在的横长皮孔，支根断落处常有黑褐色胶状物。质稍硬或略带韧性，断面稍平坦，有裂隙或放射状纹理，皮部淡黄白色至淡棕色，木部淡黄色。有特殊香气，味微甜。'}
            d = {'as': '补中益气，健脾益肺。用于脾肺虚弱，气短心悸，食少便溏，虚喘咳嗽，内热消渴。'}
            a = {'zx': '有实邪者忌服。不宜与藜芦同用。'}
        elif choice == 9:
            user = {'username': '生于山坡、溪边阴湿的草丛中或林下。我国大部分地区有分布。全国大部分地区均产；主产四川、湖北、安徽、江苏、河南，浙江等地；以四川产量大、质量好。'}
            c = {'qw': '干燥块茎呈圆球形、半圆球形或偏斜状，直径0.8～2厘米。表面白色，或浅黄色，未去净的外皮呈黄色斑点。上端多圆平，中心有凹陷的黄棕色的茎痕，周围密布棕色凹点状须根痕，下面钝圆而光滑。质坚实，致密。纵切面呈肾脏形，洁白，粉性充足；质老或干燥过程不适宜者呈灰白色或显黄色纹。粉末嗅之呛鼻，味辛辣， 嚼之发粘，麻舌而刺喉。以个大、皮净、色白、质坚实、粉性足者为佳。'}
            d = {'as': '用于痰多咳喘、痰饮眩悸、内痰眩晕、呕吐反胃、胸脘痞闷、梅核气症；生用外治痈肿痰核。姜半夏多用于降逆止呕。'}
            a = {'zx': '阴虚燥咳、津伤口渴、血证及燥痰者禁服，孕妇慎服。半夏使用不当可引起中毒，表现为口舌咽喉痒痛麻木，声音嘶哑，言语不清，流涎，味觉消失，恶心呕吐，胸闷，腹痛腹泻严重者可出现喉头痉挛，呼吸困难，四肢麻痹，血压下降，肝肾功能损害等，最后可因呼吸中枢麻痹而死亡'}
        elif choice == 10:
            user = {'username': ' 生于荒地、路旁及山坡草丛中。全国大部地区均有分布。主产于江苏、安徽、浙江、河南等地，其他各省亦产。'}
            c = {'qw': '干燥果穗呈长圆柱形或宝塔形，长2.5～6.5厘米，直径1～1.5厘米，棕色或淡紫褐色，宿萼数轮至十数轮，作覆瓦状排列，每轮有5～6个具短柄的宿萼，下方对生苞片2枚。苞片肾形，淡黄褐色，纵脉明显，基部楔形，先端尖尾状，背面生白色粗毛，宿萼唇形，上唇宽广，先端微3裂，下唇2裂，裂片尖三角形，外面有租毛。花冠及雄蕊都已脱落。宿萼内有小坚果4枚，棕色，有光泽。体轻质脆，微有清香气，味淡。以色紫褐、穗大者为佳。'}
            d = {'as': '治瘰疬，瘿瘤，乳痈，乳癌，目珠夜痛，羞明流泪，头目眩晕，口眼歪斜，筋骨疼痛，肺结核，急性黄疸型传染性肝炎，血崩，带下。'}
            a = {'zx': '脾胃虚弱者慎服。气虚者禁用。'}
        elif choice == 11:
            user = {'username': '生于荒山坡、溪边、路边疏林及灌丛中。分布江苏、浙江、安徽、湖南、湖北、河南、四川、贵州、江西、福建、广东、广西、云南、陕西等地。'}
            c = {'qw': '本品为圆形片，皱缩不平，直径1～2.5cm，厚0.2～0.4cm。外皮红色，具皱纹，有灰白小斑点。果肉深黄色至浅棕色。中部横切片具5粒浅黄色果核，但核多脱落而中空。有的片上可见短而细的果梗或花萼残迹。气微清香，味酸、微甜。'}
            d = {'as': '治肉积，癥瘕，痰饮，痞满，吞酸，泻痢，肠风，腰痛，疝气产后儿枕痛，恶露不尽，小儿乳食停滞。消食健胃，行气散瘀。用于肉食积滞、胃烷胀满、泻痢腹痛、瘀血经闭、产后瘀阻、心腹刺痛、疝气疼痛、高血脂症。'}
            a = {'zx': '脾胃虚弱者慎服。生食多，令人嘈烦易饥，损齿，齿龋人尤不宜。气虚便溏，脾虚不食，二者禁用。服人参者忌之。'}
        elif choice == 12:
            user = {'username': '主要分布在广东、广西等热带、亚热带地区。'}
            c = {'qw': '本品为扁圆柱形，略弯曲，长短不等，直径0.5～2cm。表面灰黄色或暗灰色，具纵纹及横裂纹，有的皮部横向断离露出木部；质韧，断面皮部厚，紫色或淡紫色，易与木部剥离；木部坚硬，黄棕色或黄白色，直径1～5mm。无臭，味甘而微涩。'}
            d = {'as': '治阳痿，少腹冷痛，小便不禁，子宫虚冷，风寒湿痹，腰膝酸痛。'}
            a = {'zx': '阴虚火旺者忌服。覆盆子为之使。恶朝生、雷丸、丹参。火旺泄精，阴虚水乏，小便不利，口舌干燥，四者禁用。'}
        elif choice == 13:
            user = {'username': '生于山地林缘较潮湿的地方。野生或栽培。原产我国，现各地均有栽培。'}
            c = {'qw': '根圆柱形，稍扭曲，长10-20cm，直径0.5-1cm。表面淡灰黄色或淡棕黄色，有纵皱及横生皮孔，并有支根或支根痕；根头略膨大，可见轮状排列的暗绿色或暗棕色叶柄残基、叶柄痕及密集的疣状突起。体实，质略软，折断面略平坦，皮部黄白色，约占半经的1/2-3/4，木部黄色。气微，味微甜后苦涩。以条长、粗大、体实者为佳。'}
            d = {'as': ' 主治流感，流脑，乙脑，肺炎，丹毒，热毒发斑，神昏吐衄，咽肿，痄腮，火眼，疮疹，舌绛紫暗，喉痹，烂喉丹痧，大头瘟疫，痈肿；可防治流行性乙型脑炎、急慢性肝炎、流行性腮腺炎、骨髓炎。'}
            a = {'zx': '体虚而无实火热毒者忌服。'}
        elif choice == 14:
            user = {'username': '生长于山坡、田埂，或丘陵地带。全国大部分地区有分布。主产宁夏。甘肃有少量生产。'}
            c = {'qw': '为植物宁夏枸杞的干燥成熟果实。呈椭圆形或纺锤形，略压扁，长1.5～2厘米，直径4～8毫米。表面鲜红色至暗红色，具不规则的皱纹，略有光泽，一端有白色果柄痕。肉质柔润，内有多数黄色种子；扁平似肾脏形。无臭，味甜，嚼之唾液染成红黄色。以粒大、肉厚、种子少、色红、质柔软者为佳。'}
            d = {'as': '主治肝肾阴亏，腰膝酸软，头晕，目眩，目昏多泪，虚劳咳嗽，消渴，遗精。'}
            a = {'zx': '外邪实热，脾虚有湿及泄泻者忌服。脾胃薄弱，时时泄泻者勿入。元阳气衰，阴虚精滑之人慎用。'}
        elif choice == 15:
            user = {'username': '常野生于较干燥的山坡、林缘、林中隙地、草丛及路旁。主要分布在我国的华北、东北、西北、华东等地区。'}
            c = {'qw': '呈圆柱形或长圆锥形，长6～15cm，直径0.3～0.8cm。根头膨大，顶端残留3～15个茎基或短纤维状叶基，下部分枝。表面黑褐色或浅棕色，具纵皱纹、支根痕及皮孔。质硬而韧，不易折断，断面显纤维性，皮部浅棕色，木部黄白色。气微香，味微苦。'}
            d = {'as': '主治寒热往来，胸满胁痛，口苦耳聋，头痛目眩，疟疾，下利脱肛，月经不调，子宫下垂。'}
            a = {'zx': '真阴亏损，肝阳上升者忌服。半夏为之使。恶皂荚。畏女菀、藜芦。元气下绝，阴火多汗者，误服必死。'}
        elif choice == 16:
            user = {'username': '通常生长在散射光的阔叶林中。 其生长需要适宜的湿度和充足的光照， 偏好生长于偏酸性环境中。主要分布于北京、河北、山东、江苏、浙江、福建、江西等地。'}
            c = {'qw': '外形呈伞状，菌盖肾形、半圆形或近圆形，直径10～18cm，厚1～2cm。皮壳坚硬，黄褐色至红褐色，有光泽，具环状棱纹和辐射状皱纹，边缘薄而平截，常稍内卷。菌肉白色至淡棕色。菌柄圆柱形，侧生，少偏生，长7～15cm，直径1～3.5cm，红褐色至紫褐色，光亮。孢子细小，黄褐色。气微香，味苦涩。'}
            d = {'as': '主治虚劳；心悸；失眠；头晕；神疲乏力；久咳气喘；冠心病；矽肺；肿瘤。'}
            a = {'zx': '实证慎服。恶恒山。畏扁青、茵陈蒿。'}
        elif choice == 17:
            user = {'username': '生于向阳干燥的钙质草原、河岸砂质土等地。分布东北、西北、华北等地。主产内蒙古、甘肃；其次为陕西、山西、辽宁、吉林、黑龙江、河北、青海、新疆等地。以内蒙古伊克昭盟杭锦旗所产品质最优。'}
            c = {'qw': '干燥根呈长圆柱形，不分枝，多截成长30～120厘米的段，直径0.6～3.3厘米。带皮的甘草，外皮松紧不等，显红棕色、棕色或灰棕色，具显著的皱纹、沟纹及稀疏的细根痕，皮孔横生，微突起，呈暗黄色。两端切面平齐，切面中央稍陷下。质坚实而重。断面纤维性，黄白色，粉性，有一明显的环纹和菊花心，常形成裂隙.微具特异的香气，味甜而特殊。根状茎形状与根相似，但表面有芽痕，横切面中央有髓。粉草外表平坦，淡黄色，纤维性，有纵裂纹。'}
            d = {'as': '主治脾胃虚弱，食少，腹痛便溏，劳倦发热，肺痿咳嗽，心悸，惊痫；生用，治咽喉肿痛，消化性溃疡，痈疽疮疡，解药毒及食物中毒。'}
            a = {'zx': '不宜与甘遂、大戟、芫花、海藻同用。'}
        elif choice == 18:
            user = {'username': '原生于山区丘陵地带，野生种在原产地几已绝迹。现广为栽培，安徽、江苏、浙江、福建、江西、湖南、湖北、四川、贵州等地均有，而以浙江栽培的数量最大。主产浙江、安徽。此外，湖南、湖北、江西、福建等地亦产。以浙江嵊县、新昌地区产量最大；于潜所产品质最佳，特称为"于术"。'}
            c = {'qw': '根茎规则的肥厚团块，长3~13cm，直径1.5~7cm。表面灰黄构或灰棕色，有瘤状突起及断续的纵皱和沟纹，并有须根痕，顶端有殖留茎基和芽痕。质坚 硬，不易折断；断面不平坦，黄白色至淡棕色，有棕黄色的点状油室散在，烘干者断面角质样，色较深或有裂隙。气清香，味甘、微辛，嚼之略带粘性。以个大、质坚实、断面黄白色、香气浓者为佳。'}
            d = {'as': ' 治脾胃气弱，不思饮食，倦怠少气，虚胀，泄泻，痰饮，水肿，黄疸，湿痹，小便不利，头晕，自汗，胎气不安。'}
            a = {'zx': '阴虚燥渴，气滞胀闷者忌服。凡郁结气滞，胀闷积聚，吼喘壅塞，胃痛由火，痈疽多脓，黑瘦人气实作胀，皆宜忌用。'}
        elif choice == 19:
            user = {'username': '多生长于路旁、山坡、草地上。分布几遍全国。全国大部分地区均产。'}
            c = {'qw': '干燥的根茎，呈细长圆柱形，有时分枝，长短不一，通常长30～60厘米，直径约1.5毫米，表面乳白色或黄白色，有浅棕黄色、微隆起的节；节距约3厘米。质 轻而韧，不易折断。断面纤维性，中心黄白色，并有一小孔，外圈色白，充实，或有无数空隙如车轮状，外圈与中心极易剥离。气微，味微甘。以粗肥、色白、无须根、味甜者为佳。'}
            d = {'as': '主治热病烦渴，吐血，衄血，肺热喘急，胃热哕逆，淋病，小便不利，水肿，黄疸。'}
            a = {'zx': '脾胃虚寒，溲多不渴者忌服。因寒发哕，中寒呕吐，湿痰停饮发热，并不得服。'}
        elif choice == 20:
            user = {'username': '生长于山坡草丛、石缝中或村舍附近。分布于河北、山西、陕西、安徽、浙江、江西、河南、湖北、湖南等地。'}
            c = {'qw': '干燥的鳞叶，呈长椭圆形，披针形或长三角形，长约2～4厘米，宽约0.5～1.5厘米，肉质肥厚，中心较厚，边缘薄而成波状，或向内卷曲，表面乳白色或淡黄 棕色，光滑细腻，略有光泽，瓣内有数条平行纵走的白色维管束。质坚硬而稍脆，折断面较平整，黄白色似蜡样。气微，味微苦。以瓣匀肉厚、色黄白、质坚、筋少者为佳。'}
            d = {'as': '主治肺燥或阴虚久嗽，咳唾痰血；热病后余热来清，虚烦惊悸，神志恍惚；脚气浮肿。'}
            a = {'zx': '风寒咳嗽及中寒便溏者忌服。'}
        elif choice == 21:
            user = {'username': '生于山野荒地、田埂、草地、溪边等处。全国大部分地区均有分布。全国大部地区均产。'}
            c = {'qw': '干燥全草呈黄绿色，茎方而直，上端多分枝，有纵沟，密被茸毛，棱及节上更密。质轻而韧，断面中心有白色髓部。叶交互对生于节上，边缘有稀疏的锯齿，上面深绿色，背面色较浅，两面均有细毛茸；多皱缩破碎；质薄而脆。有的在叶腋部可见紫红色皱缩小花；或有少数小坚果。有青草气，味甘微苦。以茎细、质 嫩、色绿、无杂质者为佳。'}
            d = {'as': ' 治月经不调，胎漏难产，胞衣不下，产后血晕，瘀血腹痛，崩中漏下，尿血，泻血，痈肿疮疡。'}
            a = {'zx': '阴虚血少者忌服。 孕妇禁用。'}
        elif choice == 22:
            user = {'username': '全国各地多有栽培。主产河南、浙江、四川等地。'}
            c = {'qw': '干燥的管状花，长约1.5厘米，橙红色，花管狭细，先端5裂，裂片狭线形，长5～7毫米，雄蕊5枚，花药黄色，联合成管，高出裂片之外，其中央有柱头露出。具特异香气，味微苦。以花片长、色鲜红、质柔软者为佳。'}
            d = {'as': '主治经闭，癥瘕，难产，死胎，产后恶露不行、瘀血作痛，痈肿，跌扑损伤。'}
            a = {'zx': '孕妇忌服。'}
        elif choice == 23:
            user = {'username': '多生于山坡较干燥处。分布江苏、浙江、安徽、江西、湖北、河北、山东等地。以产于江苏茅山一带者质量最好，故称茅术或茅山苍术，集散于南京者，亦称京茅术、京苍术。湖北、江西所产，多集散于汉口，故亦称汉苍术。'}
            c = {'qw': '为植物南苍术的干燥根茎，呈类圆柱形，连珠状，有节，弯曲拘挛，长约3～10厘米，直径1～1.5厘米。表面灰褐色，有根痕及短小的须根，可见茎残痕。质坚实，折断面平坦，黄白色，有明显的棕红色油腺散在，习称朱砂点。断面暴露稍久，可析出白霉样的微细针状结晶，气芳香，味微甘而辛苦。以个大、坚实、无毛须、内有朱砂点，切开后断面起白霜者佳。'}
            d = {'as': '治湿盛困脾，倦怠嗜卧，脘痞腹胀，食欲不振，呕吐，泄泻，痢疾，疟疾，痰饮，水肿，时气感冒，风寒湿痹，足痿，夜盲。'}
            a = {'zx': '阴虚内热，气虚多汗者忌服。血虚怯弱及七情气闷者慎用。误服耗气血，燥津液，虚火动而痞闷愈甚。'}
        elif choice == 24:
            user = {'username': '生于松树根上。分布于吉林、安徽、浙江、福建、台湾、河南、湖北、广西、四川、贵州、云南。'}
            c = {'qw': '菌核球形、卵形、椭圆形至不规则形，长10-30cm或者更长，重量也不等，一般重500-5000g。外面吸厚而多皱褶的皮壳，深褐色，新鲜时软干 后变硬；内部白色或淡粉红色，粉粒状。子实体生于菌核表面，全平伏，厚3-8cm，白色，肉质，老后或干后变为浅褐色。'}
            d = {'as': '治小便不利，水肿胀满，痰饮咳逆，呕哕，泄泻，遗精，淋浊，惊悸，健忘。'}
            a = {'zx': '虚寒精滑或气虚下陷者忌服。'}
        elif choice == 25:
            user = {'username': '栽培或野生于疏林下。分布云南、广西、贵州等地。主产于云南、广西、贵州等地。'}
            c = {'qw': '干燥果实呈椭圃形，具三钝棱，长2～4厘米，直径1～2.5厘米。顶端有一圆形突起，基部附有节果柄。表面灰棕色至红棕色，有显著纵沟及棱线。果皮有韧性， 易纵向撕裂。子房3室，每室含种子8～11枚，集成长球状。'}
            d = {'as': ' 主治疟疾，痰饮痞满，脘腹冷痛，反胃，呕吐，泻痢，食积。'}
            a = {'zx': '气虚或血亏，无寒湿实邪者忌服。'}
        elif choice == 26:
            user = {'username': '主产辽宁、吉林、河北、河南、山东、山西、江苏等地。'}
            c = {'qw': '种子类圆形或卵圆形，腹枝线明显，两侧常凹陷，长径1.4~1.6mm，短径0.9~1.1mm。表面灰棕色或黄棕色，微粗糙，种喙不明显；于扩大镜下可见 表面有细密深色小点，并有分布不均匀的白色丝状条纹；种脐近圆形，位于种子顶端。'}
            d = {'as': '滋补肝肾，固精缩尿，安胎，明目，止泻。用于阳痿遗精，尿有余沥，遗尿尿频，腰膝酸软，目昏耳鸣，肾虚胎漏，胎动不安，脾肾虚泻；外治白癜风。'}
            a = {'zx': '肾家多火，强阳不痿者忌之，大便燥结者亦忌之。孕妇、血崩、阳强、便结、肾脏有火、阴虚火动，六者禁用。'}
        elif choice == 27:
            user = {'username': '生于虫草蝙蝠蛾等的幼虫体上，常见于海拔4000m以上的高山上，尤多见于具有积雪、排水良好的高寒草甸。分布于甘肃、青海、湖北、四川、云南、西藏。'}
            c = {'qw': '本品由虫体及从头部长出的真菌子座组成。虫体似蚕，长3~5cm，直径3~8mm，表面深棕黄色至黄棕色，有环纹20~30个，近头部的环纹较细；头部红棕色，足8对，中部4对较明显；质脆，易折断，断面略平坦，淡黄白色。子座单生，细长圆柱形，长4~7cm，直径约3mm；表面深棕色至棕褐色，有细纵皱 纹，上部稍膨大，头部与柄无明显区别；质柔韧，断面类白色。气微腥，味淡。以虫体色泽黄亮，丰满肥大，断面黄白色，子座短小者为佳。'}
            d = {'as': ' 主治痰饮喘嗽，虚喘，痨嗽，咯血，自汗盗汗，阳痿遗精，腰膝酸痛，病后久虚不复。'}
            a = {'zx': '有表邪者慎用'}
        elif choice == 28:
            user = {'username': '生于溪旁或山坡林中。分布安徽、江苏、浙江、江西、福建等地。'}
            c = {'qw': '本品为聚合果，由多数小核果聚合而成，呈圆锥形或扁圆锥形，高0.6～1.3cm,直径0.5～1.2cm。表面黄绿色或淡棕色，顶端钝圆，基部中心凹入。宿萼棕褐色，下有果梗痕。小果易剥落，每个小果呈半月形，背面密被灰白色茸毛，两侧有明显的网纹，腹部有突起的棱线。体轻，质硬。气微，味微酸涩。'}
            d = {'as': ' 用于虚劳，目暗，肾虚遗尿，小便频数，阳痿早泄，遗精滑精。'}
            a = {'zx': '肾虚有火，小便短涩者慎服。小便不利者勿服。'}
        elif choice == 29:
            user = {'username': '生长于阳坡或干燥瘠土处，常形成灌木丛。分布辽宁、内蒙古、河北、河南、山东、山西、陕西、甘肃、安徽、江苏等地。主产河北、陕西、辽宁、河南。此外，内蒙古、甘肃、山西、山东、安徽、江苏等地亦产。'}
            c = {'qw': '种子扁圆形或扁椭圆形，长5~9mm，宽5~7mm，厚约3mm。表面紫红色或紫褐色，平滑有光泽，有的具纵裂纹。一面较平坦，中间有1条隆起的纵线纹；另一面稍凸起。一端凹陷，可见线形种脐；另端有细小凸起的合点。种皮较脆，胚乳白色，子叶2，浅黄色，富油性。气微、味淡。以粒大、饱满、有光泽、外皮红棕 色、种仁色黄白者为佳。'}
            d = {'as': '主治虚烦不眠，惊悸怔忡，烦渴，虚汗。'}
            a = {'zx': '凡有实邪郁火及患有滑泄症者慎服。'}
        elif choice == 30:
            user = {'username': '我国大部地区均产，而以山东产量最大，河南产的质量较佳。'}
            c = {'qw': '干燥花蕾呈长棒状，略弯曲，长约2～3厘米，上部较粗，直径约1.5～3毫米。外表黄色或黄褐色，被有短柔毛及腺毛。基部有绿色细小的花萼，5裂，裂片三角形，无毛。剖开花蕾，则见5枚雄蕊及1枚雌蕊。花冠唇形，雌雄蕊呈须状伸出。气芳香，味微苦。以花未开放、色黄白、肥大者为佳。'}
            d = {'as': '主治温病发热，热毒血痢，痈疡，肿毒，瘰疬，痔漏。'}
            a = {'zx': '脾胃虚寒及气虚疮疡脓清者忌服。'}
        elif choice == 31:
            user = {'username': '野生于丘陵地带山坡草丛中，或田边、路旁，高山中、下部。分布东北、内蒙古、河北、山东、河南、陕西、山西、湖南等地。'}
            c = {'qw': '根呈长圆锥形或长圆柱形，下部渐细，有的略弯曲，长15~30cm，直径0.5~2cm。表面灰棕色，粗糙，有纵皱纹、多数横长皮孔及点状突起的细根痕。根 头部有明显密集的环纹，有的部有明显密集的环纹，有的五纹上残存棕褐色毛状叶基。体轻，质松，易折断，断面不平坦，皮部浅棕色，有裂隙，散生黄棕色油点， 木部浅黄色。'}
            d = {'as': '主治外感风寒，头痛，目眩，项强，风寒湿痹，骨节酸痛，四肢挛急，破伤风。'}
            a = {'zx': '血虚痉急或头痛不因风邪者忌服。'}
        elif choice == 32:
            user = {'username': '主产四川、浙江、福建。此外，江西、湖南等地亦产。'}
            c = {'qw': '完整的果皮常剖成4瓣，每瓣多呈椭圆形，在果柄处连在一起。有时破碎分离，或呈不规则形的碎片状。片厚1～2毫米，通常向内眷曲：外表面鲜橙红色、黄棕色至棕褐色，有无数细小而凹入的油室；内表面淡黄白色，海绵状，并有短线状的维管束（橘络）痕，果蒂处较密。质柔软，干燥后质脆，易折断，断面不平。气芳香， 味苦。以皮薄、片大、色红、油润、香气浓者为佳。'}
            d = {'as': '主治胸腹胀满，不思饮食，呕吐哕逆，咳嗽痰多。亦解鱼、蟹毒。'}
            a = {'zx': '气虚及阴虚燥咳患者不宜。吐血证慎服。'}
        img_stream = return_img_stream(file_path)
        return render_template("gui.html",img_stream=img_stream,user=user,c=c,d=d,a=a,cao=cao)
    else:
        cao =None
        user = None
        c = None
        d = None
        a = None
        img_path1 = 'D:\BaiduNetdiskDownload\基于PyTorch的图像识别' + '\static' + '\images\\' + 'intro-img-713x573.jpg'
        img_stream1 = return_img_stream(img_path1)
        return render_template("gui.html",img_stream=img_stream1,user=user,c=c,d=d,a=a,cao=cao)



if __name__ == "__main__":
    img_source = cv2.imread('image/012.jpg')
    # 图像灰度化
    grey_img = cv2.cvtColor(img_source, cv2.COLOR_BGR2GRAY)
    cv2.imshow("img3", grey_img)
    print("关闭窗口即拍摄结束！")
    cv2.waitKey()# 等待按键触发
    an=modelpre(grey_img)  # 调用modelpre函数，对灰度图像进行分类
    print(an)
    print(an[0])
    print(type(an[1]))
    app.run()
  




